{
  "crop2idx": {
    "Amaranth": 0,
    "Arecanut": 1,
    "Bajra": 2,
    "Banana": 3,
    "Barley": 4,
    "Beetroot": 5,
    "Bhendi": 6,
    "Black Gram": 7,
    "Black Pepper": 8,
    "Cardamom": 9,
    "Carrot": 10,
    "Cashew": 11,
    "Chickpea": 12,
    "Chillies": 13,
    "Coconut": 14,
    "Coffee": 15,
    "Colocasia": 16,
    "Coriander": 17,
    "Cotton": 18,
    "Cowpea": 19,
    "Cumin": 20,
    "Desmodium (intercrop)": 21,
    "Elephant Foot Yam": 22,
    "Fennel": 23,
    "Fenugreek": 24,
    "Field Pea": 25,
    "Garlic": 26,
    "Ginger": 27,
    "Green Gram": 28,
    "Groundnut": 29,
    "Horse Gram": 30,
    "Jowar": 31,
    "Jute": 32,
    "Legumes": 33,
    "Lentil": 34,
    "Linseed": 35,
    "Maize": 36,
    "Marigold": 37,
    "Masoor": 38,
    "Millet": 39,
    "Millets": 40,
    "Moong": 41,
    "Mustard": 42,
    "Mustard Greens": 43,
    "Oilseeds": 44,
    "Onion": 45,
    "Paddy": 46,
    "Pearl Millet": 47,
    "Peas": 48,
    "Pigeon Pea": 49,
    "Pineapple": 50,
    "Pulses": 51,
    "Radish": 52,
    "Ragi": 53,
    "Ragi + Cowpea": 54,
    "Ragi + Desmodium": 55,
    "Red Gram": 56,
    "Rice": 57,
    "Sesame": 58,
    "Sorghum": 59,
    "Soybean": 60,
    "Spinach": 61,
    "Sugarcane": 62,
    "Sunflower": 63,
    "Sweet Potato": 64,
    "Tapioca": 65,
    "Tea": 66,
    "Tobacco": 67,
    "Tomato": 68,
    "Turmeric": 69,
    "Turnip": 70,
    "Urad": 71,
    "Wheat": 72,
    "Yam": 73
  },
  "idx2crop": {
    "0": "Amaranth",
    "1": "Arecanut",
    "2": "Bajra",
    "3": "Banana",
    "4": "Barley",
    "5": "Beetroot",
    "6": "Bhendi",
    "7": "Black Gram",
    "8": "Black Pepper",
    "9": "Cardamom",
    "10": "Carrot",
    "11": "Cashew",
    "12": "Chickpea",
    "13": "Chillies",
    "14": "Coconut",
    "15": "Coffee",
    "16": "Colocasia",
    "17": "Coriander",
    "18": "Cotton",
    "19": "Cowpea",
    "20": "Cumin",
    "21": "Desmodium (intercrop)",
    "22": "Elephant Foot Yam",
    "23": "Fennel",
    "24": "Fenugreek",
    "25": "Field Pea",
    "26": "Garlic",
    "27": "Ginger",
    "28": "Green Gram",
    "29": "Groundnut",
    "30": "Horse Gram",
    "31": "Jowar",
    "32": "Jute",
    "33": "Legumes",
    "34": "Lentil",
    "35": "Linseed",
    "36": "Maize",
    "37": "Marigold",
    "38": "Masoor",
    "39": "Millet",
    "40": "Millets",
    "41": "Moong",
    "42": "Mustard",
    "43": "Mustard Greens",
    "44": "Oilseeds",
    "45": "Onion",
    "46": "Paddy",
    "47": "Pearl Millet",
    "48": "Peas",
    "49": "Pigeon Pea",
    "50": "Pineapple",
    "51": "Pulses",
    "52": "Radish",
    "53": "Ragi",
    "54": "Ragi + Cowpea",
    "55": "Ragi + Desmodium",
    "56": "Red Gram",
    "57": "Rice",
    "58": "Sesame",
    "59": "Sorghum",
    "60": "Soybean",
    "61": "Spinach",
    "62": "Sugarcane",
    "63": "Sunflower",
    "64": "Sweet Potato",
    "65": "Tapioca",
    "66": "Tea",
    "67": "Tobacco",
    "68": "Tomato",
    "69": "Turmeric",
    "70": "Turnip",
    "71": "Urad",
    "72": "Wheat",
    "73": "Yam"
  }
}